tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "ccat"
brew "coreutils"
brew "dockutil"
brew "fzf"
brew "git"
brew "htop"
brew "hub"
brew "jq"
brew "lynx"
brew "mas"
brew "nmap"
brew "ripgrep"
brew "shellcheck"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wget"

tap "homebrew/cask"
cask "adobe-creative-cloud"
cask "bartender"
cask "bettertouchtool"
cask "daisydisk"
cask "dialpad"
cask "discord"
cask "dropbox"
cask "firefox"
cask "fluid"
cask "flux"
cask "google-chrome"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "ivpn"
cask "kextviewr"
cask "keybase"
cask "knockknock"
cask "launchcontrol"
cask "micro-snitch"
cask "nvalt"
cask "postman"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "taskexplorer"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "whatsapp"

if system('mas account')
  mas "1Password 7", id: 1333542190
  mas "Amphetamine", id: 937984704
  mas "Bear", id: 1091189122
  mas "GIPHY CAPTURE", id: 668208984
  mas "Helium", id: 1054607607
  mas "Howler Timer", id: 428846772
  mas "Image2icon", id: 992115977
  mas "Microsoft Remote Desktop", id: 1295203466
  mas "Remote Desktop", id: 409907375
  mas "Tweetbot", id: 1384080005
end

cask "blockblock"
